---
kind: method
id: M:Autodesk.Revit.DB.ConnectionValidationInfo.ManyWarnings
source: html/fe673d6f-496a-7290-3f81-34d28bc7afa9.htm
---
# Autodesk.Revit.DB.ConnectionValidationInfo.ManyWarnings Method

Returns number of warnings generated by reload.

## Syntax (C#)
```csharp
public int ManyWarnings()
```

## Exceptions
- **Autodesk.Revit.Exceptions.DisabledDisciplineException** - None of the following disciplines is enabled: Mechanical Electrical Piping.